import BottomSheetContent from "@widgets/select-ticket/components/bottom-sheet/bottom-sheet-content";
import BottomSheetHeader from "@widgets/select-ticket/components/bottom-sheet/bottom-sheet-header";
import useBottomSheetDrag from "@widgets/select-ticket/hooks/use-bottom-sheet-drag";

import * as styles from "./bottom-sheet.css";

const STADIUM_IMAGE_URL = "/stadium.webp";

const NAVIGATION_HEIGHT = 48;
const HEADER_HEIGHT = 61;
const IMAGE_HEIGHT = 271;

const BottomSheet = () => {
  const { sheetRef, headerRef, contentRef } = useBottomSheetDrag({
    navigationHeight: NAVIGATION_HEIGHT,
    headerHeight: HEADER_HEIGHT,
    maxTranslate: IMAGE_HEIGHT,
  });

  return (
    <>
      <div className={styles.base}>
        <img src={STADIUM_IMAGE_URL} alt="stadium" className={styles.image} />
      </div>

      <div ref={sheetRef} className={styles.bottomSheet}>
        <BottomSheetHeader ref={headerRef} />
        <BottomSheetContent ref={contentRef}>
          <div>엄청 긴 1글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 2글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 3글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 4글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 5글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 6글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 7글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 8글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 9글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 0글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
          <div>엄청 긴 글글글글글글글글글글글글글글글글글글글글글글글글</div>
        </BottomSheetContent>
      </div>
    </>
  );
};

export default BottomSheet;
